[
  {
    "id": "stranger-1",
    "name": "Satoshi Nakamoto",
    "title": "The Anonymous Creator of Bitcoin",
    "livesSummary": "The name used by the presumed pseudonymous person or persons who developed bitcoin, authored the bitcoin white paper, and created and deployed bitcoin's original reference implementation.",
    "reasonBehindTitle": "Operating in complete anonymity, Nakamoto created the world's first decentralized digital currency, launching a financial and technological revolution without ever revealing their true identity.",
    "lessons": "A powerful idea can change the world, even if its creator remains a mystery. The strength of a system can lie in its decentralization, not its central authority.",
    "youtubeTitle": "The Ghost in the Machine: In Search of Satoshi"
  },
  {
    "id": "stranger-2",
    "name": "Vivian Maier",
    "title": "The Secret Street Photographer",
    "livesSummary": "An American street photographer whose work was discovered and recognized after her death. She worked for about forty years as a nanny in Chicago's North Shore, pursuing photography during her spare time.",
    "reasonBehindTitle": "She took more than 150,000 photographs during her lifetime, primarily of people and cityscapes, but her work remained unknown and unpublished. Her massive, hidden archive was discovered by accident in 2007, posthumously making her one of the most acclaimed street photographers of the 20th century.",
    "lessons": "Art can be created for its own sake, not for fame or recognition. Profound beauty can be found in the everyday, seen through a curious and observant eye.",
    "youtubeTitle": "Finding Vivian Maier: An Unseen Genius"
  },
  {
    "id": "stranger-3",
    "name": "Banksy",
    "title": "The Elusive Voice of the Streets",
    "livesSummary": "A pseudonymous England-based street artist, political activist, and film director whose real name and identity remain unconfirmed and the subject of speculation.",
    "reasonBehindTitle": "Banksy's satirical street art and subversive epigrams combine dark humour with graffiti executed in a distinctive stencilling technique. His works of political and social commentary have appeared on streets, walls, and bridges throughout the world, all while maintaining complete anonymity.",
    "lessons": "Art can be a powerful tool for social commentary, and anonymity can amplify its message, forcing the focus onto the work itself, not the artist.",
    "youtubeTitle": "Exit Through the Gift Shop: A Banksy Film"
  }
]
