[
  {
    "id": "trendsetter-1",
    "name": "Andy Warhol",
    "title": "The First Pop Art Superstar",
    "livesSummary": "An American artist, film director, and producer who was a leading figure in the visual art movement known as pop art. His works explore the relationship between artistic expression, advertising, and celebrity culture.",
    "reasonBehindTitle": "He challenged traditional notions of art by embracing commercial culture, mass production, and celebrity. His Factory studio became a cultural hotspot, and his '15 minutes of fame' concept defined a modern obsession.",
    "lessons": "Art is everywhere and everything is art. The line between commerce and art is blurrier than we think.",
    "youtubeTitle": "Soup Cans & Superstars: The Andy Warhol Story"
  },
  {
    "id": "trendsetter-2",
    "name": "Coco Chanel",
    "title": "The First Modern Woman's Designer",
    "livesSummary": "A French fashion designer and businesswoman. The founder and namesake of the Chanel brand, she was credited in the post-World War I era with liberating women from the constraints of the 'corseted silhouette' and popularizing a sporty, casual chic as the feminine standard of style.",
    "reasonBehindTitle": "She introduced the 'little black dress', trousers for women, and costume jewelry, fundamentally changing what was considered acceptable and fashionable for women to wear, setting a trend for comfort and understated elegance.",
    "lessons": "Simplicity is the keynote of all true elegance. To be irreplaceable, one must always be different.",
    "youtubeTitle": "Chanel: A Woman of Her Own"
  },
  {
    "id": "trendsetter-3",
    "name": "DJ Kool Herc",
    "title": "The Father of Hip Hop",
    "livesSummary": "A Jamaican-American DJ who is credited for originating hip hop music in the Bronx, New York City, in the 1970s. His 'Merry-Go-Round' technique of using two turntables to extend the 'break' of a song was revolutionary.",
    "reasonBehindTitle": "By isolating and looping the instrumental breaks of funk records, he created the foundational rhythm of hip hop, providing the soundscape for a new generation of MCs and B-boys and sparking a global cultural movement.",
    "lessons": "Innovation often comes from re-purposing existing tools in a new way. The most powerful movements start in the streets.",
    "youtubeTitle": "The Break: How Kool Herc Created Hip Hop"
  }
]
