[
 {
   "Name": "Abu Ahmad Abd ibn Jahsh",
   "Title": "The Other Blind Companion",
   "Reason behind the Title": "A blind companion who was among the very first to embrace Islam and migrate.",
   "Lives Summary": "Despite his blindness, he navigated Mecca without a guide. He lived a long life in Medina and insisted on carrying his sister's funeral bier despite his disability.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Disability is not a barrier to excellence. Modern society should recognize the independence and potential of people with disabilities.",
   "YouTube Title": "Abu Ahmad Abd Ibn Jahsh (ra)： The Other Blind Companion ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "82"
 },
 {
   "Name": "Abu Dharr Al Ghifari",
   "Title": "The Truthful Loner",
   "Reason behind the Title": "Described by the Prophet as the most truthful person under the sky who would live and die alone.",
   "Lives Summary": "From the bandit tribe of Ghifar, he was the first to greet the Prophet with 'Salam'. He lived an ascetic life, rejecting luxuries and eventually retired to the desert.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Maintain personal integrity and speak the truth even when it is unpopular. Find spiritual peace in simplicity and detachment from materialism.",
   "YouTube Title": "Abu Dharr Al Ghifari (ra)： Living and Dying Alone ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "83"
 },
 {
   "Name": "Abu Sufyan ibn al-Harith",
   "Title": "The Prophet’s Brother",
   "Reason behind the Title": "The Prophet's paternal first cousin and foster brother who shared a striking physical resemblance to him.",
   "Lives Summary": "After being a bitter enemy for 20 years, he embraced Islam and became a devout worshiper, eventually proving his loyalty at the Battle of Hunain.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "It is never too late to repent. Maintain hope for those currently hostile to faith and practice deep humility once you have found the right path.",
   "YouTube Title": "The Prophet ﷺ’s Brother： Abu Sufyan ibn al-Harith (ra) ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman",
   "Source": "84"
 },
 {
   "Name": "Addas",
   "Title": "The Brother of Yunus (as)",
   "Reason behind the Title": "The Prophet called him this after discovering they both recognized the Prophet Yunus (Jonah) from Nineveh.",
   "Lives Summary": "A Christian slave who met the Prophet in Ta'if. After an exchange regarding the name of God, he recognized Muhammad's prophethood and became the first convert from Ta'if.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Keep an open heart and mind to truth, regardless of circumstances. Look past social hierarchies to recognize and embrace spiritual truth.",
   "YouTube Title": "Addas (ra) of Ta’if： The Brother of Yunus (as) ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": "85"
 },
 {
   "Name": "Amir Ibn Fuhayra",
   "Title": "The Guide on the Hijrah",
   "Reason behind the Title": "Played a critical role in the migration by tending sheep to cover tracks and providing food while they were in the cave.",
   "Lives Summary": "A former slave freed by Abu Bakr who was the third person on the Hijrah journey. He was martyred at Bir Ma'una, and his final words moved his killer to convert.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Loyalty and silent service are often more impactful than public speaking. Conviction at the moment of death can be the greatest 'Dawah' to others.",
   "YouTube Title": "Amir Ibn Fuhayra (ra)： The Guide on the Hijrah ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "86"
 },
 {
   "Name": "Ayyash ibn Abi Rabiah",
   "Title": "The Captive of Mecca",
   "Reason behind the Title": "Captured through deception and imprisoned in Mecca for many years, missing the early battles.",
   "Lives Summary": "Tricked by Abu Jahl into returning to Mecca, he was chained and tortured for years until he finally escaped and was martyred at Yarmuk.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Patience through prolonged personal trials and 'unanswered' prayers. Even when 'delayed' from goals, the reward remains intact through steadfastness.",
   "YouTube Title": "Ayyash ibn Abi Rabiah (ra)： The Guilt Trip That Led To Captivity ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "87"
 },
 {
   "Name": "Durra bint Abu Lahab",
   "Title": "The Believing Daughter of the Enemy",
   "Reason behind the Title": "The daughter of the Prophet's fiercest enemy, Abu Lahab, who chose the path of Islam despite her family legacy.",
   "Lives Summary": "She made the difficult migration to Medina alone. When mocked for her parentage, the Prophet publicly defended her, affirming her place in his family.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "An individual is not defined by the sins of their parents. Forge your own righteous identity regardless of family reputation.",
   "YouTube Title": "When Allah Guided the Children of Abu Lahab ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "88"
 },
 {
   "Name": "Julaybib",
   "Title": "The Most Beautiful Story",
   "Reason behind the Title": "Despite physical deformities and lack of status, the Prophet declared 'He is from me and I am from him'.",
   "Lives Summary": "An unclaimed young man who was often marginalized. The Prophet personally arranged his marriage. He killed seven enemies before being martyred and held by the Prophet.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Do not judge others by outward appearance. Actively include and honor those who are marginalized in your community.",
   "YouTube Title": "Julaybib (ra)： The Most Beautiful Story ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "89"
 },
 {
   "Name": "Ka'ab ibn Malik",
   "Title": "The Poet of Strength and Repentance",
   "Reason behind the Title": "A primary poet for the Prophet and the subject of the most famous story of sincere repentance in Islamic history.",
   "Lives Summary": "He famously stayed behind from the Battle of Tabuk without excuse. His sincere honesty regarding his mistake led to his forgiveness being revealed in the Quran.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Honesty is the only path to true relief. Owning mistakes fully and seeking repentance without justifying shortcomings is the path to forgiveness.",
   "YouTube Title": "Ka'ab Ibn Malik (ra)： The Greatest Story of Repentance ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "90"
 },
 {
   "Name": "Khubayb ibn Addiy",
   "Title": "A Prisoner of Many Miracles",
   "Reason behind the Title": "Titled for the miracles during his captivity, including eating grapes out of season while in chains.",
   "Lives Summary": "Captured through treachery, he established the sunnah of praying two raka'at before execution. He was crucified but died with poetry of faith on his lips.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Exemplifies dignity in the face of betrayal. Maintain ethical standards even when wronged, trusting that Allah provides sustenance and honor.",
   "YouTube Title": "Khubayb ibn Addiy (ra)： A Prisoner of Many Miracles ｜ The Firsts ｜ Sahaba Stories ｜ Dr Omar Suleiman.mp3",
   "Source": "91"
 },
 {
   "Name": "Rabiah ibn Kab",
   "Title": "The Prophet's Companion in Jannah",
   "Reason behind the Title": "Titled because when told he could ask for anything, he requested only to be with the Prophet in Paradise.",
   "Lives Summary": "A young, poor man who became a dedicated servant, often sleeping at the Prophet's doorstep. He spent his life in intense prayer to fulfill the Prophet's condition for companionship.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Value high aspirations over immediate worldly comforts. Serving others with sincerity is a path to greatness.",
   "YouTube Title": "Rabiah ibn Kab (ra)： The Prophet’s Companion in Jannah ｜ The Firsts ｜ Sahaba Stories ｜ Omar Suleiman",
   "Source": "92"
 },
 {
   "Name": "Rayta bint al-Harith",
   "Title": "Poisoned on the Way",
   "Reason behind the Title": "She and three children died from drinking contaminated water during their migration to Medina.",
   "Lives Summary": "An early convert who set out for Medina immediately upon hearing of the migration. She and her children died in their sleep near their destination.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Patience through sudden loss. One’s reward is secure with God once they set out for a good cause, even if they do not reach the destination.",
   "YouTube Title": "Rayta Bint Al-Harith (ra)： Poisoned on the Way ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "93"
 },
 {
   "Name": "Saeed ibn Amir al-Jumahi",
   "Title": "The Ascetic Governor",
   "Reason behind the Title": "Known for refusing a salary while serving as the Governor of Homs, living among the poorest people.",
   "Lives Summary": "Witnessing a crucifixion haunted him and led to his conversion. As governor, he lived so simply that he had no domestic help.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Maintain integrity and simplicity regardless of professional rank. Prioritize public service over personal gain.",
   "YouTube Title": "Saeed ibn Amir (ra)： Haunted by Murder ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman",
   "Source": "94"
 },
 {
   "Name": "Saeed ibn Zaid",
   "Title": "One of the Ten Promised Paradise",
   "Reason behind the Title": "Explicitly named in the famous list of ten companions guaranteed paradise during their lifetime.",
   "Lives Summary": "Son of a monotheist, he and his wife were early converts who faced Umar's wrath. He was a quiet worshipper who shunned political power.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Value sincerity and obscurity in good deeds. Do good for the sake of the act itself rather than for social media recognition.",
   "YouTube Title": "Saeed Ibn Zaid (ra)： An Answer to His Father's Prayer ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "95"
 },
 {
   "Name": "Salman Al Farsi",
   "Title": "The Truth Seeker / The Son of Islam",
   "Reason behind the Title": "He spent over thirty years traveling solely to find the final Prophet and claimed faith as his only lineage.",
   "Lives Summary": "Born a high priest in Persia, he was enslaved in Medina before being freed. He suggested the strategy of digging a trench to protect Medina.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Persistence in searching for the truth is noble. Look past cultural and racial barriers to find shared faith.",
   "YouTube Title": "Salman Al Farsi (ra)： The Truth Seeker ፡ Dr. Omar Suleiman.mp3; Salman Al Farsi (ra)： Back to Persia ｜ Dr. Omar Suleiman",
   "Source": "96, 97"
 },
 {
   "Name": "Suhaib Ibn Sinan Al Rumi",
   "Title": "From Persia, to Rome, to Paradise",
   "Reason behind the Title": "His life journey took him from an Arab noble in Persia to slavery in Rome, and then to high status in Medina.",
   "Lives Summary": "He gave up his entire fortune to the Quraysh to join the Hijra, prompting the Prophet to call it a 'profitable transaction.'",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "True wealth is what we sacrifice for our faith. Prioritize spiritual integrity over financial gain in a materialistic world.",
   "YouTube Title": "Suhaib Ibn Sinan Al Rumi (ra)： From Persia, to Rome, to Paradise ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "98"
 },
 {
   "Name": "Suraqa ibn Malik",
   "Title": "The Bounty Hunter",
   "Reason behind the Title": "He began as a bounty hunter pursuing the Prophet, only to be stopped by divine intervention.",
   "Lives Summary": "After his horse repeatedly sank into the ground, he realized the Prophet was protected. Years later, he received the golden bracelets of the Persian Emperor as prophesied.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Trust in the 'improbable' promises of Allah. An enemy can become a friend, and the most vulnerable moment can lead to future victory.",
   "YouTube Title": "Suraqa ibn Malik (ra)： The Bounty Hunter ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": "99"
 },
 {
   "Name": "Tamim al-Dari",
   "Title": "The Palestinian Sahabi",
   "Reason behind the Title": "He originated from Palestine and was a scholar who brought oil lamps to light the Prophet's mosque.",
   "Lives Summary": "A former Christian priest who met the Dajjal while lost at sea. He was known for intense devotion, often reciting a single verse all night.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Bringing 'light' to the community through service or knowledge is a high virtue. Enrich local mosques with service and private worship.",
   "YouTube Title": "Tamim al-Dari (ra)： The Palestinian Sahabi that met Dajjal ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": "100"
 },
 {
   "Name": "Umm Kulthum bint Uqbah",
   "Title": "The First Female Migrant (Single)",
   "Reason behind the Title": "Distinguished as the first woman to make the Hijra from Mecca to Medina alone while still single.",
   "Lives Summary": "Daughter of a fierce enemy of the Prophet. Her arrival led to a Quranic revelation protecting female migrants under the Treaty of Hudaybiyyah.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Find the courage to stand for beliefs even when leaving a comfortable environment. Model for individual agency and spiritual independence for women.",
   "YouTube Title": "Umm Kulthum Bint Uqbah Ibn Abi Muayt (ra)： The Enemy's Daughter ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "101"
 },
 {
   "Name": "Umm Ma’bad",
   "Title": "The Source of the Most Beautiful Description",
   "Reason behind the Title": "She provided an eloquent and detailed physical description of the Prophet after he stopped at her tent during the Hijra.",
   "Lives Summary": "A Bedouin woman who witnessed a miracle of overflowing milk during a drought. Her vivid description became the gold standard for the Prophet's appearance.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Hospitality to strangers can lead to unexpected divine blessings. High standards of manners can leave a lasting, positive impression of faith.",
   "YouTube Title": "Umm Ma’bad (ra)： The Most Beautiful Description of the Prophet ﷺ ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "102"
 },
 {
   "Name": "Umm Mahjan (ra)",
   "Title": "The Woman Who Cleaned the Masjid",
   "Reason behind the Title": "An African woman of humble background who took it upon herself to keep the Prophet’s Mosque clean and perfumed.",
   "Lives Summary": "She lived in a small tent in the mosque. When she passed away, the Prophet sought out her grave to pray for her specifically, honoring her humble service.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "No act of service is small. Emulate her by volunteering for 'invisible' tasks, realizing sincere actions are noticed by Allah even if overlooked by people.",
   "YouTube Title": "Umm Mahjan (ra)： The Woman Who Cleaned the Masjid ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": "103"
 },
 {
   "Name": "Umm Salama",
   "Title": "A Separated Family",
   "Reason behind the Title": "She endured a painful year-long separation from her husband and child due to tribal interference during their migration.",
   "Lives Summary": "A noble woman who migrated to Abyssinia and Medina. After her husband's death, she made a famous dua for a better replacement and married the Prophet.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Represents patience through family trials. Trust that Allah provides better outcomes through patience and supplication during separation.",
   "YouTube Title": "Umm Salama (ra) - Part 1： A Separated Family ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "104"
 },
 {
   "Name": "Uthman Ibn Madhun",
   "Title": "The One Who Took Nothing From the World",
   "Reason behind the Title": "The Prophet stated that the world did not change him or take anything from his character.",
   "Lives Summary": "One of the first twenty to accept Islam, known for deep piety and refusing alcohol even before Islam. He was the first 'Muhajir' to die in Medina.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Promotes detachment from materialism (Zuhd). Maintain principles regardless of social pressure and live simply, focusing on the spiritual.",
   "YouTube Title": "Khawla Bint Hakim & Uthman Ibn Madhun (ra)： The Righteous Couple ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "105"
 },
 {
   "Name": "Zahir ibn Haram",
   "Title": "The Bedouin of the Family",
   "Reason behind the Title": "The Prophet called him 'our Bedouin' and treated him like a beloved family member from the desert.",
   "Lives Summary": "A poor Bedouin with low self-esteem whom the Prophet hugged in the marketplace and declared 'priceless' in the sight of Allah.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Use humor and affection to build the self-esteem of others. Affirm the worth of every believer regardless of physical traits.",
   "YouTube Title": "Zahir ibn Haram (ra)： Low Self-Esteem Until He Met the Prophet ﷺ ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "106"
 },
 {
   "Name": "Zaid ibn al-Khattab",
   "Title": "The Silent Giant",
   "Reason behind the Title": "The older brother of Omar, known for being extremely quiet despite his imposing physical stature.",
   "Lives Summary": "He was a veteran of Badr and Uhud who sought martyrdom sincerely. He was the flag bearer at Yamama, where he was martyred.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Highlights the virtue of quiet, sincere action. One can be a massive influence through steadfastness without needing the spotlight.",
   "YouTube Title": "Zayd ibn al-Khattab (ra)： The Quiet Brother of Omar (ra) ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": "107"
 },
 {
   "Name": "Zaid Ibn Amr ibn Nufayl",
   "Title": "A One Man Ummah",
   "Reason behind the Title": "The Prophet said he will be resurrected as a whole nation because he was the only monotheist in Mecca following the way of Abraham before revelation.",
   "Lives Summary": "A seeker of truth who protected infant girls from being buried alive and avoided alcohol. He was killed shortly before the Prophet's mission began.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Courage to be different and follow conscience against corruption. Be the lone voice for ethics even if it makes you a 'stranger'.",
   "YouTube Title": "Zaid Ibn Amr (ra)： A One Man Ummah ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "108"
 },
 {
   "Name": "Zinneera",
   "Title": "The One Whose Sight was Restored",
   "Reason behind the Title": "A slave whose sight was miraculously restored by Allah after she defended her faith while being beaten.",
   "Lives Summary": "Brutally tortured by Abu Jahl, she firmly declared idols were powerless. Her sight was immediately restored before she was freed by Abu Bakr.",
   "Categorization": "(The Strangers )",
   "Lessons and Modern Application (Inferred)": "Unwavering conviction in the face of suffering. Remain firm in the belief that ultimate power belongs to God alone.",
   "YouTube Title": "Zinneera (ra) and Aflah (ra)： The Tortured Ones ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "109"
 }
]