[
 {
   "Name": "Abdullah ibn Amr (ra)",
   "Title": "The One Who Preserved The Sunnah",
   "Reason behind the Title": "The first companion to systematically document the sayings of the Prophet in 'Al-Sahifah al-Sadiqah'.",
   "Lives Summary": "The son of Amr ibn Al-As who embraced Islam before his father. He was initially prone to over-exertion in worship but was guided by the Prophet toward moderation.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Highlights the importance of documentation and intellectual preservation. Learn the value of religious moderation and the necessity of preserving heritage through technology.",
   "YouTube Title": "Abdullah ibn Amr (ra)： The One Who Preserved The Sunnah ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 67
 },
 {
   "Name": "Abbas ibn Abd al-Muttalib",
   "Title": "The Uncle of the Prophet",
   "Reason behind the Title": "Held in the highest esteem as the Prophet's paternal uncle; the Prophet stated the uncle is like the father.",
   "Lives Summary": "A wealthy uncle who protected the Prophet in Mecca and became a pillar of the community in Medina, respected for his lineage and wisdom.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Highlights the importance of family support and maintaining ties. Act as a bridge and mediator within a family or organization to maintain unity.",
   "YouTube Title": "The Most Honored Man By The Prophet ﷺ ： Abbas ibn Abd al-Muttalib (ra) ｜The Firsts Dr. Omar Suleiman.mp3",
   "Source": 68
 },
 {
   "Name": "Al-Baraa ibn Aazib",
   "Title": "The Detailed Narrator",
   "Reason behind the Title": "Distinguished by his precision in narrating over 300 hadith, particularly descriptions of the soul's journey.",
   "Lives Summary": "An Ansari who embraced Islam at age 10. He participated in 15 battles and became a meticulous scholar who recorded the Prophet's physical appearance and mannerisms.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Value the importance of precision and detail in religious education. Dedicate youth to learning and preserving authentic knowledge while maintaining discipline.",
   "YouTube Title": "Al-Baraa ibn Aazib (ra)： He Described the Grave in Detail ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": 69
 },
 {
   "Name": "Al-Shifa bint Abdullah",
   "Title": "The Healer and Scholar",
   "Reason behind the Title": "A skilled medical practitioner and one of the few literate women who taught others to read and write.",
   "Lives Summary": "A wise woman whose home became a center for consultation. Umar ibn al-Khattab highly respected her and consulted her on commerce, finance, and market affairs.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Pursue education and professional skills as a form of worship. Balance professional expertise, public service, and spiritual devotion.",
   "YouTube Title": "Al-Shifa bint Abdullah (ra)： The Healer and Scholar ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 70
 },
 {
   "Name": "Fadl ibn Abbas",
   "Title": "The Riding Companion",
   "Reason behind the Title": "Frequently chosen by the Prophet to ride behind him on his camel, notably during the Farewell Hajj.",
   "Lives Summary": "A handsome young man with the Prophet during the Conquest of Mecca and the Prophet's final illness. He later died as a martyr in the Levant.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Taught the discipline of the gaze and modesty. Practice self-control and respect in social interactions, especially in an age of visual saturation.",
   "YouTube Title": "Fadl ibn Abbas (ra)： How The Prophet ﷺ Made Him Lower His Gaze ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 71
 },
 {
   "Name": "Hakim ibn Hizam",
   "Title": "The One Born in the Kaaba",
   "Reason behind the Title": "The only person authentically recorded to have been born inside the Kaaba sanctuary.",
   "Lives Summary": "A wealthy merchant who embraced Islam after the conquest of Mecca. He took an oath to never ask anyone for anything and became a generous philanthropist.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Teaches the transition from material greed to spiritual generosity. Seek financial independence while using wealth to solve community problems anonymously.",
   "YouTube Title": "Hakim ibn Hizam (ra)： When Money Stops Mattering ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 72
 },
 {
   "Name": "Hisham ibn al-As",
   "Title": "The Better Brother",
   "Reason behind the Title": "Called 'better' by his brother Amr because Hisham embraced Islam earlier and achieved martyrdom before him.",
   "Lives Summary": "He was imprisoned and tortured in Mecca for ten years. He later served as a valiant soldier in Syria and reinvigorated the army at Ajnadayn.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Worth is not defined by worldly fame but by early commitment to truth. Be a 'silent achiever'—supporting causes without the need for public recognition.",
   "YouTube Title": "Amr ibn al-As (ra)： His Wicked Father & “Better” Brother ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 73
 },
 {
   "Name": "Ikrimah ibn Abi Jahl",
   "Title": "The Pious Son of Pharaoh",
   "Reason behind the Title": "The son of Abu Jahl (the 'Pharaoh of this Ummah') who became a deeply devoted and pious Muslim.",
   "Lives Summary": "A fierce enemy for twenty years who fled to Yemen before his heart softened. He dedicated his later life to redemption and was martyred at Yarmouk.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "No matter your past or family background, it is never too late to change. Avoid judging others by their parents' mistakes and leave the door open for reconciliation.",
   "YouTube Title": "Ikrimah ibn Abi Jahl (ra)： The Pious Son of Pharoah ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman",
   "Source": 74
 },
 {
   "Name": "Najashi (Ashama ibn Abjar)",
   "Title": "The Righteous King",
   "Reason behind the Title": "Described by the Prophet as a just king under whom no one is oppressed before he even met the Muslims.",
   "Lives Summary": "The ruler of Abyssinia who provided refuge to Muslim migrants. He privately embraced Islam and is the only person for whom the Prophet prayed the funeral prayer in absentia.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Justice and integrity are universal values. Those in positions of power should protect the vulnerable and refugees, recognizing authority is a gift for upholding righteousness.",
   "YouTube Title": "Najashi - Ashama Ibn Abjar (ra)： The Righteous King ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 75
 },
 {
   "Name": "Qutham ibn Abbas",
   "Title": "The Prophet’s Lookalike",
   "Reason behind the Title": "Noted for having the strongest physical resemblance to the Prophet among his family members.",
   "Lives Summary": "He had the honor of being the last person to leave the Prophet's grave during burial. He eventually took Islam to Samarkand, where he was martyred.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Focus on the long-term 'seeds' of your actions. Even the youngest family members can carve out unique paths of service that affect millions for centuries.",
   "YouTube Title": "Qutham ibn Abbas (ra)： The Prophet’s ﷺ Lookalike ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 76
 },
 {
   "Name": "Sawda Bint Zama’a",
   "Title": "The Prophet’s Joy",
   "Reason behind the Title": "Known for her loving, humorous personality and her ability to make the Prophet laugh during his years of grief.",
   "Lives Summary": "An early convert and the second wife of the Prophet. She was a motherly figure distinguished by immense generosity, often giving away gifts immediately.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Sawda’s legacy is one of selflessness and positivity. Be a source of comfort and humor for those in pain and practice radical generosity without seeking recognition.",
   "YouTube Title": "Sawda Bint Zama’a (ra)： The Prophet’s Joy ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 77
 },
 {
   "Name": "Tufayl ibn Amr ad-Dusi",
   "Title": "Dhu-Nur (The Possessor of Light)",
   "Reason behind the Title": "A miracle of light appeared on his whip as a sign for his people, granted after the Prophet's prayer.",
   "Lives Summary": "A noble poet and chief who brought ninety families to Islam. He was a dedicated caller to the faith and was martyred after seeing his death in a dream.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Use personal talents and influence to guide others toward goodness. Use your 'platform' to speak the truth and remain persistent in inviting to good with gentleness.",
   "YouTube Title": "Tufayl ibn Amr (ra)： The Hidden Legend ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": 78
 },
 {
   "Name": "Tulayha ibn Khuwaylid",
   "Title": "The Resurrected Penitent",
   "Reason behind the Title": "Redeemed his soul through extreme bravery in battles against the Persians after a past as a false prophet.",
   "Lives Summary": "A tribal chief who initially claimed to be a prophet but later sincerely repented and became a hero in the battles of Qadisiyah and Nahawand.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "It is never too late to repent and reform. Strive to over-compensate for past wrongs with extraordinary good deeds and sincere service to humanity.",
   "YouTube Title": "Tulayha ibn Khuwaylid (ra)： From False Prophet to Shaheed ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 79
 },
 {
   "Name": "Ubayy ibn Ka'b",
   "Title": "The Master of all Reciters",
   "Reason behind the Title": "Explicitly named by the Prophet as the best reciter among the companions whom Allah commanded the Prophet to recite to.",
   "Lives Summary": "A primary scribe for the Prophet and master of the Quran. He served as the first imam for Taraweeh prayers and most modern narration chains trace back to him.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Ubayy’s life emphasizes mastering a craft for the sake of God. Strive for excellence in spiritual and professional pursuits grounded in sincerity.",
   "YouTube Title": "Ubayy ibn Ka'b (ra)： The Master of all Reciters ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 80
 },
 {
   "Name": "Zaynab bint Ali",
   "Title": "The Heroine of Karbala",
   "Reason behind the Title": "Known for her courageous stand and eloquent speeches against tyrants after the massacre of her family.",
   "Lives Summary": "The daughter of Ali and Fatima who inherited her parents' strength. She witnessed the martyrdom of her family at Karbala and became their voice as a captive in Damascus.",
   "Categorization": "(The Revivers )",
   "Lessons and Modern Application (Inferred)": "Speaking truth to power and maintaining composure during immense grief. Be a voice for the oppressed and stand up against injustice in political and social spheres.",
   "YouTube Title": "Zaynab bint Ali (ra)： A Voice of Courage ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": 81
 }
]