[
 {
   "Name": "Aisha bint Abu Bakr (ra)",
   "Title": "The Mother of the Believers / The One Exonerated by Allah",
   "Reason behind the Title": "Titled after her innocence was declared by Allah from above seven heavens after a great slander (Ifk).",
   "Lives Summary": "The most beloved wife of the Prophet and a brilliant scholar. She witnessed his last moments and became a primary teacher of the Ummah.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Represents the intellectual power of women. Emulate her by seeking deep knowledge and remaining patient when faced with character assassination.",
   "YouTube Title": "Aisha bint Abu Bakr (ra)： Slander and Death of the Prophet ﷺ ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 110
 },
 {
   "Name": "Asma Bint Yazid",
   "Title": "The Orator of the Women",
   "Reason behind the Title": "She was chosen as the spokesperson to represent and voice the concerns of the women of Medina to the Prophet.",
   "Lives Summary": "A strong woman who asked if women share rewards for Jihad. She was a prolific narrator and later personally killed nine soldiers with a tent pole at Yarmuk.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Be courageous in seeking religious knowledge and articulating communal needs. Active participation in domestic and public spheres when called upon.",
   "YouTube Title": "Asma Bint Yazid (ra)： The Orator of the Women ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 111
 },
 {
   "Name": "Atika bint Zayd",
   "Title": "The Wife of Many Martyrs",
   "Reason behind the Title": "She was married to five prominent companions, including Umar and Hussein, all of whom died as martyrs.",
   "Lives Summary": "Renowned for her beauty and eloquence, each of her marriages ended in martyrdom. She was a woman of great scholarship and integrity.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Maintain spiritual resilience through repeated personal loss. Use talents like poetry to process grief and continue serving the community.",
   "YouTube Title": "Atika bint Zayd (ra)： The Wife of Many Martyrs ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 112
 },
 {
   "Name": "Abu Bakra",
   "Title": "The Freed Slave of Allah",
   "Reason behind the Title": "The Prophet called him this to affirm his freedom after he escaped slavery in Taif using a well-wheel (Bakra).",
   "Lives Summary": "An Abyssinian slave who joined the Prophet and became a prolific narrator of Hadith. He lived a life of scholarship, avoiding political turmoil.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Importance of welcoming new converts with encouragement. Value 'sincere enthusiasm' over 'perfect performance' and provide a supportive environment.",
   "YouTube Title": "Abu Bakra (ra)： The Freed Slave of Allah ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman",
   "Source": 113
 },
 {
   "Name": "Al Bara' Ibn Malik",
   "Title": "The Underestimated Hero",
   "Reason behind the Title": "Unimposing and dusty in appearance, yet his oaths were always fulfilled by Allah.",
   "Lives Summary": "A legendary warrior who had himself catapulted over walls to open gates for the Muslims. He died as a martyr after saving his brother's life.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Do not judge by appearances. Support 'unsung heroes' in communities who do great work without seeking fame.",
   "YouTube Title": "Al Bara' Ibn Malik (ra)： The Underestimated Hero ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": 114
 },
 {
   "Name": "Bishr ibn al-Baraa",
   "Title": "The Martyr of Khaybar",
   "Reason behind the Title": "He died following a poisoning incident, choosing not to spit out the food out of respect (Adab) for the Prophet.",
   "Lives Summary": "A veteran of Badr and Uhud who ate from the poisoned lamb served to the Prophet. He died from the poison, and his mother remained a model of patience.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Prioritize 'Adab' and reverence for sacred leadership. Maintain a living connection with those who have passed away through prayer.",
   "YouTube Title": "Bishr ibn al-Baraa (ra)： The Story of the Poisoning of the Prophet ﷺ ｜ The Firsts ｜ Dr Omar Suleiman.mp3",
   "Source": 115
 },
 {
   "Name": "Burayda ibn al-Husayb",
   "Title": "The Unlikely Convert",
   "Reason behind the Title": "He set out to capture the Prophet for a reward but converted along with his entire tribe mid-journey.",
   "Lives Summary": "The chief of the Sahm tribe who converted after a single conversation. He used his turban as a banner for the Prophet’s entry into Medina.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Never underestimate a single conversation. Be open to changing perspective when faced with truth and lead others toward good.",
   "YouTube Title": "Burayda ibn al-Husayb (ra)： An Unlikely Convert ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman",
   "Source": 116
 },
 {
   "Name": "Fatima bint Qays",
   "Title": "The Keeper of the Dajjal Hadith",
   "Reason behind the Title": "Primary narrator of the 'Hadith of Jassasa' and a figure whose divorce case set significant legal precedents.",
   "Lives Summary": "An early Muhajir woman whose home was respected enough that the Shura council convened there to choose the third Caliph.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Follow prophetic advice even when it challenges social expectations. Women should be keepers of knowledge and participate in communal deliberation.",
   "YouTube Title": "Fatima bint Qays (ra)： She Preserved Hadiths About Dajjal & Divorce ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 117
 },
 {
   "Name": "Jarir ibn Abdullah",
   "Title": "The Yusuf of this Ummah",
   "Reason behind the Title": "Titled by Umar due to his physical beauty and noble character which resembled the Prophet Joseph.",
   "Lives Summary": "A Yemeni king whom the Prophet honored. He was a brilliant horseman and wise leader who mediated between tribes.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "True beauty is the harmony of physical grace and inner character. Use influence to reconcile people and protect the dignity of others.",
   "YouTube Title": "Jarir ibn Abdullah (ra)： The Yusuf of this Ummah ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 118
 },
 {
   "Name": "Ka’b ibn Zuhayr",
   "Title": "The Master of the Mantle (Burda)",
   "Reason behind the Title": "Recipient of the Prophet's own cloak as a gift of honor after reciting a poetic masterpiece.",
   "Lives Summary": "Initially used his talent to mock Islam, but later repented publicly. The Prophet was so moved by his poem that he gave him his own mantle.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Redirect worldly talents and professional skills toward noble causes. Use communication to bridge divides and express the beauty of faith.",
   "YouTube Title": "Ka’b ibn Zuhayr (ra)： The Story of the First Burda ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": 119
 },
 {
   "Name": "Sa'ad ibn Ubadah",
   "Title": "Al-Kamil (The Perfect One)",
   "Reason behind the Title": "Nicknamed 'The Perfect' because he mastered literacy, archery, swimming, and calligraphy.",
   "Lives Summary": "A chief known for legendary hospitality, hosting eighty people for dinner every night. He was a leader of the Ansar who served with protective honor.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Practice radical hospitality and multi-generational generosity. Support community kitchens and ensure no neighbor goes hungry.",
   "YouTube Title": "Sa'ad Ibn Ubadah (ra)： The Generous Chief ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": 120
 },
 {
   "Name": "Subay'a al-Aslamiyya",
   "Title": "The Scholarly Widow",
   "Reason behind the Title": "Primary source for Islamic jurisprudence regarding the waiting period (Iddah) of a pregnant widow.",
   "Lives Summary": "She gave birth two weeks after her husband's death and was told her waiting period ended with delivery, a ruling she helped preserve.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Religion provides ease during life's transitions. Challenge cultural stigmas against remarriage and highlight women's scholarship in clarifying religious law.",
   "YouTube Title": "Subay'a Al-Aslamiyya (ra)： The Iddah of a Widow ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": 121
 },
 {
   "Name": "Thabit ibn Qays",
   "Title": "Spokesperson of the Prophet",
   "Reason behind the Title": "Official orator (Khateeb) who spoke on behalf of the Prophet due to his powerful, booming voice.",
   "Lives Summary": "An Ansari leader who feared his loud voice would nullify his deeds. The Prophet promised him Paradise. He achieved martyrdom wearing his funeral shroud as a uniform.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Use natural talents for the defense of truth. Be self-reflective and fearful of arrogance while remaining courageous in professional duties.",
   "YouTube Title": "Thabit ibn Qays (ra)： Promised Jannah After A Sin ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman",
   "Source": 122
 },
 {
   "Name": "Thumama ibn Uthal",
   "Title": "The Man Who Boycotted Mecca",
   "Reason behind the Title": "The first to implement an economic boycott against the Quraysh to stop their persecution of Muslims.",
   "Lives Summary": "The King of Yamama who was released by the Prophet without condition, leading to his conversion. He remained loyal despite local apostasy.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Economic leverage is a legitimate and powerful tool for social justice. Sincerity often means being willing to walk away from worldly power to protect principles.",
   "YouTube Title": "Thumama ibn Uthal (ra)： The most powerful Muslim of his time？ ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 123
 },
 {
   "Name": "Ubaydullah ibn Abbas",
   "Title": "The Rich Little Brother",
   "Reason behind the Title": "The successful merchant brother who used his wealth to support his brother's students and the poor.",
   "Lives Summary": "Born during the boycott of the Prophet, he was known for legendary generosity, once giving 500 dinars for a single goat because the owner gave his all.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Find your own unique role. Not everyone must be a scholar; some are meant to be 'donors' who enable knowledge to flourish.",
   "YouTube Title": "Ubaydullah ibn Abbas (ra)： The Rich Little Brother ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 124
 },
 {
   "Name": "Umayr ibn Sa’d",
   "Title": "One of a Kind (Naseej Wahduh)",
   "Reason behind the Title": "Titled by Umar due to peerless integrity, compared to a uniquely woven garment with no equal.",
   "Lives Summary": "An orphan who reported his foster father's hypocrisy to the Prophet. As governor, he lived so frugally that he walked from Syria to Medina with only a bowl.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Maintain absolute integrity in power. Modern leaders can learn to live as 'servants' of the people, ensuring public funds are used for the needy.",
   "YouTube Title": "Umayr ibn Sa’d (ra)： First in Salah and Battle ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 125
 },
 {
   "Name": "Umm Kulthum bint Ali",
   "Title": "The Daughter of the Noble Ones",
   "Reason behind the Title": "Carried the dual noble lineage of being the granddaughter of the Prophet through Ali and Fatima.",
   "Lives Summary": "Married to Umar ibn al-Khattab, she was known for humility, famously helping a poor traveler give birth in a tent while Umar cooked for them.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Humility regardless of noble birth. Engage in direct service to the poor and never feel above manual labor or helping a stranger in distress.",
   "YouTube Title": "Umm Kulthum (ra)： Daughter of Ali (ra) & Wife of Umar (ra) ｜ Sahaba ｜ The Firsts Dr. Omar Suleiman.mp3",
   "Source": 126
 },
 {
   "Name": "Umm Sulaym (Rumaysa)",
   "Title": "The One whose Dowry was Islam",
   "Reason behind the Title": "She refused to marry Abu Talha unless he embraced Islam, making his conversion her sole gift.",
   "Lives Summary": "One of the first women in Medina to embrace Islam. She was known for bravery in battle and giving her son Anas to the Prophet's service.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Value spiritual compatibility over material wealth in relationships. Dedicate children to community service and maintain resilience during personal tragedies.",
   "YouTube Title": "Umm Sulaym (ra)： Her Dowry Was Islam ｜ The Firsts ｜ Dr Omar Suleiman",
   "Source": 127
 },
 {
   "Name": "Urwa ibn az-Zubayr",
   "Title": "The First Muslim Historian",
   "Reason behind the Title": "The first to systematically compile and document the Sira (biography) of the Prophet Muhammad.",
   "Lives Summary": "A Tabi'i who dedicated his life to scholarship. He is famous for extreme patience, refusing anesthesia during an amputation while in prayer.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Dedicate time to studying history accurately. Focus on what you still have rather than what you lost during personal tragedy.",
   "YouTube Title": "Urwa ibn az-Zubayr (ra)： The First Muslim Historian ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 128
 },
 {
   "Name": "Urwa ibn Masud",
   "Title": "The Resembler of Jesus",
   "Reason behind the Title": "The Prophet described him as the person who most physically resembled Jesus (Isa), the son of Mary.",
   "Lives Summary": "A noble chief of Ta'if and a skilled diplomat who eventually embraced Islam and was martyred by his own people while calling the Adhan.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Use high social status to promote peace and truth. Influencers should use their platforms to introduce righteous practices and shift cultural trends.",
   "YouTube Title": "Urwa ibn Masud (ra)： The Chief Who Resembled Isa (as) ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": 129
 },
 {
   "Name": "Usayd Ibn Hudayr",
   "Title": "Transformed by the Quran",
   "Reason behind the Title": "A tribal chief immediately changed upon hearing the Quran, leading to the conversion of his entire tribe.",
   "Lives Summary": "Known for his beautiful voice and love for the Quran, which angels would descend to listen to. He was a steady supporter of the Prophet.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Power of listening before judging. Approach differing viewpoints with an open heart and allow divine wisdom to shape actions.",
   "YouTube Title": "Usayd Ibn Hudayr (ra)： Transformed by the Quran ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 130
 },
 {
   "Name": "Utbah ibn Ghazwan",
   "Title": "The Humble Governor",
   "Reason behind the Title": "Despite being the conqueror and governor of Basra, he chose to live in a tent and avoid all luxury.",
   "Lives Summary": "The seventh person to embrace Islam. He preached against being 'great in one's own eyes but small in the sight of Allah.'",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Beware of how material success can change the heart. Stay grounded in 'early' values even when achieving high social rank.",
   "YouTube Title": "Utbah ibn Ghazwan (ra)： The Humble Governor ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 131
 },
 {
   "Name": "Zayd ibn al-Arqam",
   "Title": "The Exposer of Hypocrites",
   "Reason behind the Title": "As a boy, he heard the leader of the hypocrites plotting; his truthfulness was later confirmed by Allah in the Quran.",
   "Lives Summary": "An orphan who participated in 17 expeditions. Despite being called a liar by hypocrites, he was exonerated by revelation and became a scholar.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "Age is not a barrier to possessing courage and integrity. Youth should feel empowered to stand up against social hypocrisy.",
   "YouTube Title": "Zayd ibn Al-Arqam (ra)： Exposer of Hypocrites ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 132
 },
 {
   "Name": "Zaynab bint Jahsh (ra)",
   "Title": "The Longest Arm",
   "Reason behind the Title": "The Prophet said the wife with the 'longest arm' would follow him first in death, referring to her immense charity.",
   "Lives Summary": "Known for her manual labor (tanning skins) which she did specifically to earn money for charity. She was a devout worshiper who died soon after the Prophet.",
   "Categorization": "(The Trendsetters)",
   "Lessons and Modern Application (Inferred)": "True nobility is found in service and charity rather than lineage. Use skills to earn and immediately give back to those in need.",
   "YouTube Title": "Zaynab bint Jahsh (ra)： The Longest Arm ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": 133
 }
]