[
 {
   "Name": "Abdullah ibn Abbas (ra)",
   "Title": "The Ocean (Al-Bahr)",
   "Reason behind the Title": "Nicknamed for his vast, expansive knowledge of the Quran and religion that seemed to have no end.",
   "Lives Summary": "The cousin of the Prophet who shadowed him in youth. After the Prophet's death, he dedicated his life to collecting hadith from senior companions, eventually becoming the leading scholar of the Ummah and the interpreter of the Quran.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Prioritize the pursuit of religious knowledge regardless of age and show extreme humility toward teachers. Seek knowledge from credible scholars and be cautious about speaking about the Quran without deep study.",
   "YouTube Title": "Abdullah ibn Abbas (ra)： The Most Knowledgeable Scholar in the World ｜ The Firsts ｜ Dr Omar Suleiman.mp3",
   "Source": "29"
 },
 {
   "Name": "Abdullah ibn az-Zubayr (ra)",
   "Title": "The Pigeon of the Masjid",
   "Reason behind the Title": "Titled for his extreme dedication to prayer; he stood so still in the mosque that birds would land on him as if he were a pole.",
   "Lives Summary": "The first child born to the Muhajirun in Medina. Known for legendary courage, he served as the Caliph in Mecca for many years before being martyred while defending the Kaaba against the army of Al-Hajjaj ibn Yusuf.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "His life teaches uncompromising integrity and the importance of remaining steadfast in prayer during political upheaval. Modern followers can learn to prioritize worship and maintain dignity when facing opposition.",
   "YouTube Title": "Abdullah ibn az-Zubayr (ra)： The Last Martyr Standing ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "30"
 },
 {
   "Name": "Abdullah ibn Hudhafah",
   "Title": "The Man Who Wouldn't Flinch",
   "Reason behind the Title": "He displayed absolute composure when facing torture and psychological games by the Persian and Roman emperors.",
   "Lives Summary": "An early convert who delivered the Prophet's letter to Kisra. Captured by the Byzantines, he refused half the empire to renounce his faith. He eventually negotiated the release of 300 Muslim prisoners by kissing the forehead of the Roman emperor.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Practice unshakable integrity in the face of material temptation. Personal ego should be sacrificed for the collective benefit of the community, as shown when he humbled himself to save his fellow prisoners.",
   "YouTube Title": "Abdullah ibn Hudhafah (ra)： The Man Who Wouldn't Flinch ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "31"
 },
 {
   "Name": "Abdullah ibn Jahsh",
   "Title": "The First Commander",
   "Reason behind the Title": "He was the first person in Islam formally appointed with the title of 'Amir' (Commander).",
   "Lives Summary": "A cousin of the Prophet who participated in the migration to Abyssinia. He led the Nakhlah raid and at the Battle of Uhud, made a sincere prayer for martyrdom and to be mutilated for Allah's sake. He was buried in the same grave as his uncle Hamza.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Cultivate extreme sincerity in prayer and be willing to serve in leadership roles with patience. Modern Muslims can apply his legacy by seeking internal spiritual excellence (Ihsan) rather than just recognition.",
   "YouTube Title": "Abdullah ibn Jahsh (ra)： An Accepted Prayer ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "32"
 },
 {
   "Name": "Abdullah ibn Masood",
   "Title": "Keeper of the Sandals (and Secrets)",
   "Reason behind the Title": "He was so close to the Prophet that he carried his sandals and had general permission to enter the Prophet's home.",
   "Lives Summary": "A shepherd of humble origins who embraced Islam at 13. Despite his small stature, he was a giant in knowledge and the first to recite the Quran publicly at the Kaaba, where he was beaten unconscious. He later served as the governor of Kufa.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Physical stature and social status do not define one's weight in the sight of God. Modern believers should prioritize deep, personal literacy of the Quran over worldly prestige.",
   "YouTube Title": "Abdullah Ibn Masood (ra)： A Mighty Legacy of Qur'an ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "33"
 },
 {
   "Name": "Abdullah ibn Salam",
   "Title": "The Righteous Rabbi",
   "Reason behind the Title": "He was the chief rabbi of Medina and a descendant of Prophet Joseph who recognized the truth of Islam upon the Prophet's arrival.",
   "Lives Summary": "Formerly known as Al-Husayn, he recognized signs from the Torah in the Prophet's face. He became the first rabbi to embrace Islam and served as a scholar and advisor, later attempting to mediate during the assassination of Uthman.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Seek truth with sincerity even if it means losing social status. Experts in religious or academic fields should use knowledge to guide others toward truth rather than for personal or economic advantage.",
   "YouTube Title": "Abdullah ibn Salam (ra)： The Righteous Rabbi ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "34"
 },
 {
   "Name": "Abdullah ibn Suhayl",
   "Title": "The Side-Switcher",
   "Reason behind the Title": "During the Battle of Badr, he was brought out by the Quraysh but defected and joined the Muslim army just before the fight.",
   "Lives Summary": "The son of Suhayl ibn Amr, he was imprisoned by his father for his Islam. He pretended to renounce his faith to escape and later fought for the Muslims at Badr and Al-Yamama, where he achieved martyrdom.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Taught the importance of strategic patience and internal resolve. Modern application: maintaining one's values even when external pressure forces a temporary compromise for safety.",
   "YouTube Title": "Abu Jandal, Abdullah, & Suhayl Ibn Amr (ra)： Switching Sides ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "35"
 },
 {
   "Name": "Abdullah ibn Umar (ra)",
   "Title": "The Prophet's Shadow",
   "Reason behind the Title": "Known for meticulous adherence to the Sunnah, following the Prophet in every physical detail and action.",
   "Lives Summary": "The son of Umar ibn Al-Khattab who became the gold standard for piety in Medina. He lived a life of asceticism, avoiding political fitna while becoming one of the most prolific narrators of hadith.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "True love for the Prophet is shown through consistent action and discipline. Follow him by being precise in daily worship and showing immense charity to the poor in local communities.",
   "YouTube Title": "Abdullah ibn Umar (ra)： The Prophet’s ﷺ Shadow ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": "36"
 },
 {
   "Name": "Abu Darda",
   "Title": "The Wise Man of This Ummah",
   "Reason behind the Title": "Titled by the Prophet because of his profound intellect and devotion to knowledge and wisdom.",
   "Lives Summary": "A wealthy merchant who became a sincere ascetic. He memorized the entire Quran during the Prophet's lifetime and served as the scholar of Damascus, where he established the first formal Quran school system.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Learn the value of quality over quantity in worship; he emphasized contemplation (tafakkur) over ritual. Modern application involves setting aside digital devices for reflection and praying for others by name.",
   "YouTube Title": "Abu Darda (ra)： The Scholar Who Wouldn't Sleep ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "37"
 },
 {
   "Name": "Abu Dujana (Simak ibn Kharasha)",
   "Title": "The Red Bandana",
   "Reason behind the Title": "He wore a distinct 'bandana of death' whenever he was prepared to fight with absolute commitment until the end.",
   "Lives Summary": "An Ansar warrior entrusted with the Prophet's sword at Uhud. He acted as a human shield for the Prophet and was known for his humility and for avoiding speech that did not concern him. He was martyred fighting against Musaylimah.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Maintain a 'warrior's discipline' in personal ethics—being strong in public duty but gentle in private character. Focus on 'leaving that which does not concern you' to achieve spiritual peace.",
   "YouTube Title": "Abu Dujana (ra)： The Red Bandana ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": "38"
 },
 {
   "Name": "Abu Huraira",
   "Title": "The Preserver of Hadith",
   "Reason behind the Title": "He narrated more narrations from the Prophet than any other human being in history, aided by divine assistance for his memory.",
   "Lives Summary": "Born in Yemen, he lived in extreme poverty as part of the Ahl al-Suffa in Medina. He remained inseparable from the Prophet to learn and later taught the largest circles of students in Medina for decades.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Prioritize the quality of spiritual legacy over material wealth. Use technology and memory to spread authentic religious knowledge while maintaining humility and care for parents.",
   "YouTube Title": "Abu Huraira (ra)： The Preserver of Hadith ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "39"
 },
 {
   "Name": "Abu Mahdhura",
   "Title": "The Muezzin of Mecca",
   "Reason behind the Title": "The Prophet appointed him to be the permanent caller of prayer in Mecca after hearing his beautiful voice.",
   "Lives Summary": "Originally a youth who mocked the Adhan, the Prophet encouraged him and changed his heart through mercy. He became the official Muezzin of the Haram, a position his descendants held for generations.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Mentorship involves seeing potential in critics. Instead of punishing those who mock values, look for their talents and redirect them toward positive contributions with wisdom.",
   "YouTube Title": "Abu Mahdhura (ra)： The Kid Who Mocked Adhan ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman",
   "Source": "40"
 },
 {
   "Name": "Abu Musa al-Ash‘ari",
   "Title": "The Great Reciter",
   "Reason behind the Title": "He possessed an exceptionally beautiful voice, described by the Prophet as one of the instruments of the family of David.",
   "Lives Summary": "Born in Yemen, he traveled to Medina and served as a governor and jurist. He was a renowned warrior who lived a life of modesty and poverty despite his high political status.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Strive to beautify the recitation of the Quran and share knowledge with others. Volunteer to teach literacy or dedicate time to service while maintaining a humble lifestyle despite success.",
   "YouTube Title": "Abu Musa al-Ash‘ari (ra)： A Voice Like No Other ፡ The Firsts ፡ Sahaba Stories ፡ Dr. Omar Suleiman.mp3",
   "Source": "41"
 },
 {
   "Name": "Abu Sufyan ibn Harb (ra)",
   "Title": "The Rock / Leader of Quraysh",
   "Reason behind the Title": "His name, Sakhr, means 'The Rock', fitting his sturdy character as the leader to whom people retreated.",
   "Lives Summary": "A powerful aristocrat who was a chief opponent of Islam for two decades. He eventually embraced Islam during the Conquest of Mecca and lost both eyes in service of Islam at the battles of Hunayn and Yarmouk.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "It is never too late for redemption. Former enemies can become the most loyal protectors through mercy. Learn to overlook past grievances to build communal unity.",
   "YouTube Title": "Abu Sufyan ibn Harb (ra) ： Forgiving the Enemy ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": "42"
 },
 {
   "Name": "Abu Ubaydah ibn al-Jarrah",
   "Title": "The Trustworthy One (Ameen)",
   "Reason behind the Title": "Designated as the 'Ameen of this Ummah' when a Christian delegation requested a trustworthy man to teach them.",
   "Lives Summary": "One of the ten promised paradise, he was a general known for extreme asceticism. At Uhud, he used his own teeth to pull helmet links out of the Prophet’s face. He later commanded the conquest of Damascus.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Leadership is a trust to be fulfilled with humility. Modern professionals should be reliable in responsibilities and choose the collective good over personal ego.",
   "YouTube Title": "Abu Ubaydah Ibn Al Jarrah (ra)： The Trustworthy One ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "43"
 },
 {
   "Name": "Aisha bint Abu Bakr",
   "Title": "The Scholar of the Ummah / Mother of the Believers",
   "Reason behind the Title": "The most knowledgeable person of her time and the most beloved person to the Prophet, often called the daughter of the truthful man.",
   "Lives Summary": "The daughter of Abu Bakr and wife of the Prophet. She turned her home into a center of learning after his death, taught over 2,000 hadiths, and was famous for giving away vast sums of wealth in a single day while fasting.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Modern Muslims can follow her by championing female education and intellectual rigor. Her life teaches the importance of critical thinking and living a simple life despite having access to resources.",
   "YouTube Title": "Aisha bint Abu Bakr (ra)： Legacy and Life after Rasulallah ﷺ ｜ Dr. Omar Suleiman; Aisha Bint Abu Bakr (ra)： The Early Years of Sacrifice ፡ Dr. Omar Suleiman",
   "Source": "44-46"
 },
 {
   "Name": "Amr ibn al-As",
   "Title": "The Cunning of the Arabs",
   "Reason behind the Title": "Renowned for his extreme intelligence, political brilliance, and strategic mind among the Quraysh.",
   "Lives Summary": "A master diplomat who initially opposed Islam but later became a great military commander and the conqueror of Egypt.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Intelligence and talent should be channeled into noble causes. Use professional skills like diplomacy or management to benefit the community.",
   "YouTube Title": "Amr ibn al-As (ra)： From Rafah to Egypt ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": "47"
 },
 {
   "Name": "Amr ibn Al Jamuh",
   "Title": "No Limping in Jannah",
   "Reason behind the Title": "Titled after he asked the Prophet if his severe physical limp would be gone in Paradise, which the Prophet later confirmed in a vision.",
   "Lives Summary": "A chief of the Benu Salim who was a devoted idol worshipper before his family helped him realize the idols' powerlessness. Despite his age and limp, he achieved martyrdom at Uhud.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Physical limitations or late starts in faith do not hinder potential for devotion. Strive for sincere dedication to goals and refuse to let excuses prevent seeking a higher purpose.",
   "YouTube Title": "Amr ibn Al Jamuh (ra)： No Limping in Jannah ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "48"
 },
 {
   "Name": "Asim ibn Thabit",
   "Title": "Hamiyul-Ad-Dabr",
   "Reason behind the Title": "The Protector of the Faith whose body was miraculously protected by a swarm of bees from the polytheists after his death.",
   "Lives Summary": "A master archer and military strategist from the Ansar who plotted the tactics for Badr. He was eventually ambushed and martyred at the well of Ar-Raji'.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Focus on mastering a specific skill for the benefit of the community and maintain a sincere relationship with Allah. Modernly, use professional expertise to defend ethical causes.",
   "YouTube Title": "Asim ibn Thabit (ra)： Protector of Faith ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman.mp3",
   "Source": "49"
 },
 {
   "Name": "Hamza ibn Abdul-Muttalib",
   "Title": "The Lion of Allah",
   "Reason behind the Title": "Named for his incredible strength, courage in battle, and his role as the premier protector of the Prophet.",
   "Lives Summary": "The Prophet's uncle and foster brother, he embraced Islam to protect his nephew and became a legendary commander, martyred at Uhud and titled the Master of Martyrs.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Strength should be used to protect the vulnerable. Stand up against bullying or injustice in society using your status or influence.",
   "YouTube Title": "Hamza Ibn Abdulmuttalib (ra)： The Lion of Allah ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "50"
 },
 {
   "Name": "Hanzala Ibn Abi Amr",
   "Title": "Ghasil al-Mala'ika",
   "Reason behind the Title": "He was washed by the angels after his martyrdom because he answered the call to battle on his wedding night.",
   "Lives Summary": "A young companion who joined the Battle of Uhud immediately after his wedding night. He fought bravely and was martyred. His father was a bitter opponent of Islam, yet he remained devoted.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Prioritize communal duties and sacred calls over personal comfort. This translates to showing immediate response to humanitarian crises even when personal life is demanding.",
   "YouTube Title": "Hanzala Ibn Abi Amr (ra) and Jameela (ra)： When Angels Bathe You ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "49, 51"
 },
 {
   "Name": "Hasan ibn Ali (ra)",
   "Title": "The Master / Leader / Reconciler",
   "Reason behind the Title": "Titled 'Sayyid' (Master) by the Prophet, who predicted he would reconcile two great Muslim armies.",
   "Lives Summary": "The beloved grandson of the Prophet who abdicated his position as Khalifa to Muawiyah to end bloodshed among Muslims, ushering in the 'Year of Unity'.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Value 'peace over ego'. In an age of polarization, be willing to sacrifice personal status for the greater good of community unity and to stop unnecessary conflict.",
   "YouTube Title": "Hasan ibn Ali (ra)： The Beloved Grandson of the Prophet ﷺ ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": "52"
 },
 {
   "Name": "Hassan ibn Thabit",
   "Title": "The Master of All Poets",
   "Reason behind the Title": "He was the primary poet who defended the Prophet and the honor of Islam through eloquent and sharp lyrics.",
   "Lives Summary": "A famous poet from Medina who used his verbal skills to dismantle enemy propaganda. Though he did not fight in physical battles, he was a key figure in the intellectual defense of the faith.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Everyone has a unique talent to contribute to the truth. Use digital media, art, or writing to stand up for justice and counteract misinformation in the public sphere.",
   "YouTube Title": "Hassan ibn Thabit (ra)： The Master of All Poets ፡ The Firsts ፡ Dr. Omar Suleiman.mp3",
   "Source": "53"
 },
 {
   "Name": "Husayn ibn Ali",
   "Title": "The Master of the Youth of Paradise",
   "Reason behind the Title": "A title reflecting his high spiritual status and noble character as the Prophet's grandson.",
   "Lives Summary": "The grandson of the Prophet who stood against the corruption of Yazid. His life culminated in the courageous sacrifice at Karbala, where he was martyred after refusing to surrender his principles to tyranny.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Victory is not always measured by physical survival but by the preservation of truth. Stand up against injustice and systemic corruption with unwavering conviction.",
   "YouTube Title": "Husayn ibn Ali (ra)： Redefining Victory in Karbala ｜ The Firsts ｜ Sahaba Stories ｜ Dr. Omar Suleiman",
   "Source": "54"
 },
 {
   "Name": "Jafar ibn Abi Talib",
   "Title": "Dhul-Janahayn / Abul Masakin",
   "Reason behind the Title": "'The One with Two Wings' in Paradise and 'Father of the Poor' due to his deep love for the needy.",
   "Lives Summary": "The cousin of the Prophet who led the migration to Abyssinia. He lived in exile for over a decade before returning to Medina and being martyred at the Battle of Mu'tah.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Follow his example of eloquent advocacy for faith in unfamiliar environments. Represent values with dignity in diverse societies and show proactive care for the underprivileged.",
   "YouTube Title": "Jafar Ibn Abi Talib (ra)： Flying In Paradise ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "55"
 },
 {
   "Name": "Juwayriya bint al-Harith",
   "Title": "A Blessing to Her People",
   "Reason behind the Title": "Her marriage to the Prophet led to the release of 100 families of her tribe from captivity as an act of respect.",
   "Lives Summary": "The daughter of a chief who approached the Prophet for her ransom. After their marriage, her people embraced Islam. She was known for long sessions of morning remembrance and an ascetic lifestyle.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "One's status can be used as a means of mercy for others. Dedicate quiet time to spiritual reflection and use influence to bring benefit to the community.",
   "YouTube Title": "Juwayriya bint al-Harith (ra)： A Blessing to Her People ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "56"
 },
 {
   "Name": "Khalid ibn al-Walid",
   "Title": "The Sword of Allah",
   "Reason behind the Title": "Titled by the Prophet after his brilliant tactical withdrawal and performance at the Battle of Mu'tah.",
   "Lives Summary": "A military genius who never lost a battle. After converting, he served as the premier general of the Islamic state and led the conquests of Persia and Rome, eventually dying in his bed in Syria.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "It is never too late to change one's path. Use professional expertise—whether in leadership or strategy—for ethical causes and maintain sincerity even when removed from power.",
   "YouTube Title": "Khalid ibn al-Walid (ra)： Becoming the Sword of Allah ｜ The Firsts ｜ Dr. Omar Suleiman.mp3; Khalid ibn al-Walid (ra)： The Legendary Military General ፡ The Firsts ፡ Sahaba ፡ Dr. Omar Suleiman.mp3",
   "Source": "57, 58"
 },
 {
   "Name": "Omar ibn Al-Khattab (ra)",
   "Title": "Al-Faruq (The One who Distinguishes)",
   "Reason behind the Title": "Titled because he famously distinguished between truth and falsehood through his decisiveness.",
   "Lives Summary": "Initially a fierce opponent, he became the second Khalifa. He established justice and the Hijri calendar, living a lifestyle of poverty despite being the most powerful man in the world.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "He exemplifies radical self-honesty and justice. Hold yourself accountable before judging others and ensure leadership is rooted in protecting the rights of the weak.",
   "YouTube Title": "Omar Ibn Al Khattab (ra)： 10 Unique Virtues ｜ The Firsts with Dr. Omar Suleiman.mp3",
   "Source": "59"
 },
 {
   "Name": "Sa'ad ibn Muadh",
   "Title": "The Man Who Shook the Throne",
   "Reason behind the Title": "The Prophet stated that the Throne of the Most Merciful shook out of joy upon the death and return of his soul to the heavens.",
   "Lives Summary": "The chief of the Aws tribe whose conversion led to the mass conversion of his entire tribe. He was a pillar of strength during the trench and died shortly after being a Muslim for only six years.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Sincerity is more important than the duration of service. Use your 'throne' of authority to stand firmly for truth and justice, regardless of tribal or political costs.",
   "YouTube Title": "Sa'ad Ibn Muadh (ra)： The Man Who Shook The Throne ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "60"
 },
 {
   "Name": "Saad Ibn Abi Waqqas",
   "Title": "His Prayers Always Answered",
   "Reason behind the Title": "The Prophet made a specific supplication for Saad's aim to be directed and for his prayers (dua) to always be answered.",
   "Lives Summary": "A teenager when he embraced Islam, he endured his mother's hunger strike while prioritizing faith. He led the conquest of the Persian Empire and later chose a life of obscurity to avoid civil strife.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Maintain excellence toward family even when they oppose your values. Avoid unnecessary social conflict and stay humble while avoiding divisive politics.",
   "YouTube Title": "Saad Ibn Abi Waqqas (ra)： His Prayers Always Answered ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "61"
 },
 {
   "Name": "Safiyya bint Huyayy",
   "Title": "Mother of the Believers",
   "Reason behind the Title": "A title given to all wives of the Prophet, signifying her spiritual mother status to the community.",
   "Lives Summary": "A descendant of Prophets Harun and Musa who chose Islam over returning to her people. She faced suspicion due to her background but remained loyal and firm in her path.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Practice forgiveness and empathy even toward those who harbor prejudice. Inspire bridge-building between different faith communities and stay firm despite social scrutiny.",
   "YouTube Title": "Safiyya bint Huyayy (ra)： A Heart of Gold ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "62"
 },
 {
   "Name": "Suhayl ibn Amr",
   "Title": "The Eloquent Orator",
   "Reason behind the Title": "Known as the chief negotiator and most eloquent man of the Quraysh, famous for powerful speech.",
   "Lives Summary": "Initially a staunch enemy who negotiated the Treaty of Hudaybiyyah, he embraced Islam and stopped the people of Mecca from apostatizing after the Prophet's death.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "A model for redemption and using communication skills for peace. Utilize public speaking or influence to prevent conflict and guide others toward stability.",
   "YouTube Title": "Abu Jandal, Abdullah, & Suhayl Ibn Amr (ra)： Switching Sides ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "35"
 },
 {
   "Name": "Umayr ibn Wahb",
   "Title": "Shaitan of Quraysh (formerly) / The Disciple of Islam",
   "Reason behind the Title": "Once known for fierce opposition; later celebrated for dedication after a failed assassination plot against the Prophet.",
   "Lives Summary": "A skilled spy who conspired to assassinate the Prophet. When the Prophet revealed the secret details of the plot, Umayr embraced Islam and transformed into a bold caller to the faith.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Demonstrates the power of divine truth to change a person's trajectory; one's past as an enemy does not preclude them from becoming a hero through sincere repentance.",
   "YouTube Title": "A Foiled Conspiracy： Umayr ibn Wahb (ra) & Safwan ibn Umayyah (ra) ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "63"
 },
 {
   "Name": "Umm Waraqa bint Abdullah",
   "Title": "The Martyred Hafidha",
   "Reason behind the Title": "Nicknamed 'The Martyr' by the Prophet during his lifetime because he knew her ultimate fate.",
   "Lives Summary": "A wealthy, literate woman who memorized the entire Quran. She requested to join Badr, but the Prophet told her she would find martyrdom in her home, which happened when she was murdered by servants.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Women should pursue the highest levels of religious scholarship. Her life encourages dedication to the Quran and the recognition of the spiritual status of female scholars.",
   "YouTube Title": "Umm Waraqa bint Abdullah (ra)： The Martyred Hafidha ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "64"
 },
 {
   "Name": "Zaynab bint Khuzayma",
   "Title": "The Mother of the Poor",
   "Reason behind the Title": "Known as 'Umm al-Masakin' due to her extreme generosity and kindness to the needy even before Islam.",
   "Lives Summary": "She married the Prophet in Ramadan 4 AH but died only three months later. She was famous for never keeping extra food, choosing to sleep hungry to feed others.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "True charity is a lifestyle. Strive to be 'mothers' and 'fathers' to the poor in your local community, ensuring no neighbor goes hungry while you have excess.",
   "YouTube Title": "Zaynab bint Khuzayma (ra)： The Mother of the Poor ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "65"
 },
 {
   "Name": "Zubayr ibn Al-Awwam",
   "Title": "The Disciple (Al-Hawari)",
   "Reason behind the Title": "The Prophet declared 'Every Prophet has a disciple, and my disciple is Zubayr' due to his immediate response to aid.",
   "Lives Summary": "One of the earliest converts at age 12, he was the first to draw a sword for Islam in Mecca. He was a legendary warrior at Badr and was one of the ten promised paradise.",
   "Categorization": "(The Distinguished)",
   "Lessons and Modern Application (Inferred)": "Encourages swiftness in doing good and responding to moral calls. Maintain integrity and withdraw from conflict when the truth becomes clear.",
   "YouTube Title": "Zubayr Ibn Awwam (ra)： The Disciple ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "66"
 }
]