[
 {
   "Name": "Abu Bakr as-Siddiq",
   "Title": "As-Siddiq / Atiq",
   "Reason behind the Title": "Titled 'As-Siddiq' (The Truthful) for his unconditional belief during the Night Journey (Al-Isra' wal-Mi'raj) and 'Atiq' (The Freed) as a promise of salvation from the fire.",
   "Lives Summary": "The closest friend of the Prophet, born into the noble Banu Taym. He never worshipped idols and spent his vast merchant fortune to free oppressed slaves like Bilal. He accompanied the Prophet during the Hijra, shielding him in the cave. As the first Caliph, he stabilized the Ummah during the Ridda wars and was known for secret acts of charity, such as cleaning the home of a blind woman.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Prioritize loyalty and unwavering faith in divine truth. Modern individuals can follow his example by performing secret acts of service for the vulnerable without seeking public recognition or political power.",
   "YouTube Title": "Abu Bakr (ra) - Part 1： Second to None in the Pursuit of God ｜ The Firsts ｜ Dr. Omar Suleiman; Abu Bakr (ra) - Part 2： Setting His Own Standards ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "1-3"
 },
 {
   "Name": "Al-Arqam Ibn Abil Arqam",
   "Title": "The House of Islam",
   "Reason behind the Title": "His home was the secret headquarters where the Prophet taught early Muslims and where many prominent companions embraced the faith.",
   "Lives Summary": "A teenager from the Banu Makhzum who embraced Islam at age 14. He strategically offered his home near Mount Safa as a sanctuary. Despite being from the same tribe as Abu Jahl, he remained undetected for years while hosting the Prophet. He participated in all battles and left his house as a permanent legacy for the community.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Utilize personal resources and 'privilege' (like a home or social status) for the benefit of the community without seeking fame. Young people today can learn that age is not a barrier to being a foundational pillar of the faith.",
   "YouTube Title": "Al-Arqam Ibn Abil Arqam (ra)： The House of Islam ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "4"
 },
 {
   "Name": "Al-Baraa ibn Ma’roor",
   "Title": "The First of the Ansar",
   "Reason behind the Title": "He was the first person from Medina to take the pledge of allegiance (Bay'ah) at the Pledges of 'Aqabah.",
   "Lives Summary": "A respected elder and chief of the Bani Salama. Even before the Qibla change, he instinctively prayed toward the Kaaba. He brought his entire family to Islam but passed away one month before the Prophet's Hijra. He was the first person for whom the Prophet prayed the funeral prayer (Janaza) at a grave site in Medina.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Follow the natural inclination of a pure heart toward truth. His life encourages modern Muslims to be 'first' in taking initiative for good causes and to maintain family-wide devotion to faith.",
   "YouTube Title": "Al-Baraa ibn Ma’roor (ra)： He Made Two Good Mistakes ｜ The Firsts ｜ Sahaba ｜ Dr. Omar Suleiman.mp3",
   "Source": "5"
 },
 {
   "Name": "Ali ibn Abi Talib",
   "Title": "Asadullah (Lion of Allah)",
   "Reason behind the Title": "His mother named him 'Haydar' (Lion), and the Prophet called him 'Asadullah' for his immense courage and strength in battle.",
   "Lives Summary": "The cousin of the Prophet raised in his household. He was the first child to accept Islam at age ten. He famously risked his life by sleeping in the Prophet's bed to foil an assassination plot during the Hijra. Known for deep knowledge and eloquence, he married Fatima and served as the fourth Caliph.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Ali's life exemplifies youthful courage and intellectual depth. Modern youth can emulate him by standing firm in their values even when alone and by seeking a balance between physical strength and spiritual humility.",
   "YouTube Title": "Ali ibn Abi Talib (ra)： Courageous & Steadfast ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "6"
 },
 {
   "Name": "Asma bint Abi Bakr",
   "Title": "Dhat an-Nitaqayn (The Possessor of Two Waist Belts)",
   "Reason behind the Title": "Titled after she tore her waist belt into two pieces to tie and carry food for the Prophet and her father during the Hijra.",
   "Lives Summary": "The daughter of Abu Bakr and the 15th person to embrace Islam. She showed immense courage during the Hijra, enduring physical assault from Abu Jahl. She lived a life of poverty and struggle in Medina, raised eight children, and lived to the age of 100 while remaining a fierce truth-teller against tyrants.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Exemplify resilience and courage in the face of adversity. Modern application involves being resourceful in supporting good causes and maintaining dignity in the face of intimidation or economic hardship.",
   "YouTube Title": "Asma Bint Abi Bakr (ra)： The Possessor of Two Waist Belts ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "7"
 },
 {
   "Name": "As'ad ibn Zurara",
   "Title": "The First Convert of Madinah",
   "Reason behind the Title": "He was the first person from Yathrib (Medina) to extend his hand and pledge allegiance during the meetings at Aqaba.",
   "Lives Summary": "The young chief of the Banu Najjar who founded Islam in Medina. He hosted Mus'ab ibn Umayr, organized the first Friday prayers before the Prophet's arrival, and donated the land where the Prophet's Mosque was built. He passed away during the first year of the Hijra.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Take initiative in community building. Contemporary youth can learn to be proactive leaders who lay foundations for long-term communal success, even if they do not live to see the final results.",
   "YouTube Title": "As’ad Ibn Zurara (ra)： The First Convert of Madinah ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "8"
 },
 {
   "Name": "Bilal Ibn Rabah",
   "Title": "The Voice of Certainty",
   "Reason behind the Title": "He remained steadfast during extreme torture in the desert, repeatedly saying 'Ahad, Ahad' (One, One).",
   "Lives Summary": "Born into slavery in Mecca, he was among the first seven to declare Islam. He was brutally tortured by Umayyah ibn Khalaf but was eventually freed by Abu Bakr. He became the first Muadhin (caller to prayer), participated in all battles, and called the Adan from the top of the Ka'bah.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Resist social and systemic pressure that contradicts core values. Maintain integrity under duress and recognize that true status comes from spiritual character and devotion rather than social class or race.",
   "YouTube Title": "Bilal Ibn Rabah (ra)： The Voice of Certainty ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "9"
 },
 {
   "Name": "Khabbab Ibn Al Aratt",
   "Title": "Under Burning Hot Coals",
   "Reason behind the Title": "Titled for the horrific torture where his oppressors placed him on burning hot coals that were extinguished only by his own melting flesh.",
   "Lives Summary": "An Arab enslaved as a child who became a master swordsmith. He was one of the first ten to embrace Islam and the first to be tortured publicly. Despite permanent scars, he remained steadfast. He later achieved wealth but remained fearful that his rewards were being exhausted in this life.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Khabbab's life is a testament to resilience under extreme pressure. His example encourages staying firm in principles despite societal backlash and remaining humble even after achieving success or wealth.",
   "YouTube Title": "Khabbab Ibn Al Aratt (ra)： Under Burning Hot Coals ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "10"
 },
 {
   "Name": "Khalid ibn Sa’id",
   "Title": "The Possessor of the Crown",
   "Reason behind the Title": "Nicknamed for his unique style of wearing a turban that others did not dare to imitate until he changed his style.",
   "Lives Summary": "One of the first five to embrace Islam after a prophetic dream saved him from a pit of fire. He endured severe persecution from his father, migrated to Abyssinia, and served as the representative for Umm Habiba's marriage to the Prophet. He was martyred while serving as a commander.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Value spiritual guidance over family approval when they conflict. His story teaches that divine guidance often comes to those who are searching, and one should act immediately upon finding the truth.",
   "YouTube Title": "Khalid Ibn Sa’id Ibn al-'As (ra)： A Dream of the Prophet ﷺ ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "11"
 },
 {
   "Name": "Khunais ibn Hudhafah",
   "Title": "The First Husband of Hafsa",
   "Reason behind the Title": "Titled as the first husband of Hafsa bint Umar and the first son-in-law of Umar ibn al-Khattab.",
   "Lives Summary": "One of the first twenty to embrace Islam. He migrated to both Abyssinia and Medina and was the only member of the Banu Sahm tribe to fight at Badr. He died from wounds received at Uhud and was personally buried by the Prophet in Al-Baqi.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "The value of being a trailblazer in one's family or tribe. Even if one's role seems quiet in history, the legacy of guiding others to faith—as he did with his brothers—is immeasurable.",
   "YouTube Title": "Khunais ibn Hudhafah (ra)： The First Husband of Hafsa (ra) ｜ The Firsts with Dr. Omar Suleiman",
   "Source": "12"
 },
 {
   "Name": "Lubaba Bint Al-Harith (Um al-Fadl)",
   "Title": "The First Woman After Khadijah",
   "Reason behind the Title": "Recognized as the second woman to embrace Islam, having accepted the faith on the same day as Khadijah.",
   "Lives Summary": "The wife of Al-Abbas and mother of Abdullah ibn Abbas. She was a courageous protector of the faith in Mecca, famously striking Abu Lahab when he attacked a fellow Muslim. She raised elite scholars and warriors and remained a close confidant to the Prophet's household.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Women should take active roles in spiritual leadership and family education. Her life teaches the importance of bravery in the face of tyranny and the power of nurturing the next generation of scholars.",
   "YouTube Title": "Lubaba Bint Al-Harith (ra)： The First Woman After Khadijah (ra) ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "13"
 },
 {
   "Name": "Mihja ibn Salih",
   "Title": "The First Martyr of Badr",
   "Reason behind the Title": "He was the very first companion to be martyred on the battlefield during the Battle of Badr.",
   "Lives Summary": "A formerly enslaved man freed by Umar ibn al-Khattab. He was a devoted worshipper who prayed at night. At Badr, he was struck by an arrow while repeating that he was returning to his Lord. The Prophet categorized him as one of the best of his people.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "The pursuit of ultimate sacrifice and devotion. Modern application involves being the first to step forward for noble causes and maintaining a deep, private connection with God through night prayer.",
   "YouTube Title": "Mihja, Umayr, and Ubayda (ra)： The Martyrs of Badr ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "14"
 },
 {
   "Name": "Miqdad Ibn Aswad",
   "Title": "Better Than A Thousand Men",
   "Reason behind the Title": "Titled by Caliph Umar who acknowledged that Miqdad's individual bravery and skill were equal to a thousand soldiers.",
   "Lives Summary": "Originally from Yemen, he was one of the first seven to declare Islam and suffered severe torture. He was the only horseman at the Battle of Badr and famously boosted the army's morale. He was a master archer and a devoted companion known for his humility.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Develop specialized skills to serve the community uniquely. Be the person who steps forward with courage when others are hesitant, providing moral and practical support to leaders.",
   "YouTube Title": "Miqdad Ibn Aswad (ra)： Better Than A Thousand Men ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "15"
 },
 {
   "Name": "Nusaybah bint Ka'ab (Umm 'Amarah)",
   "Title": "The Woman Warrior",
   "Reason behind the Title": "Known for her unparalleled bravery, specifically for shielding the Prophet with her sword and shield during the chaos of Uhud.",
   "Lives Summary": "An Ansari woman who took the second pledge at Aqabah. At Uhud, she picked up a sword to defend the Prophet, sustaining 13 wounds. The Prophet praised her for fighting in every direction around him. She later lost an arm at the Battle of Yamama while pursuing the false prophet Musaylimah.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Challenges gender stereotypes in service and courage; modern application involves standing up for justice and protecting others even when the situation seems hopeless.",
   "YouTube Title": "Nusaybah bint Ka'ab (ra)： The Woman Warrior ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "16"
 },
 {
   "Name": "Nuaym ibn Abdullah",
   "Title": "The Redirector of History",
   "Reason behind the Title": "He was the one who diverted Umar ibn al-Khattab on his way to kill the Prophet, which led to Umar's conversion.",
   "Lives Summary": "The 11th person to embrace Islam, he hid his faith to support the widows and orphans of his tribe. He eventually migrated during the time of Hudaybiyyah with 40 converts from his tribe. He died as a martyr at the Battle of Yarmouk.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Social service can be a powerful form of Dawah. By being indispensable through kindness and charity, modern Muslims can protect themselves and soften hearts toward their faith.",
   "YouTube Title": "Nuaym Ibn Abdullah (ra)： Redirecting History ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "17"
 },
 {
   "Name": "Saalim Mawla Abu Hudhaifa",
   "Title": "The Imam of the People of Quran",
   "Reason behind the Title": "He was the primary leader of prayer due to his superior knowledge and beautiful recitation of the Quran.",
   "Lives Summary": "A man of Persian descent who was a freed slave. He transcended social barriers to become a master of the Quran. He died at the Battle of Yamama while holding the banner even after his hands were severed. Umar stated he would have appointed Saalim as his successor if he were alive.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Focus on meritocracy and spiritual excellence rather than ancestry or social status. Modern communities should prioritize knowledgeable leadership, following his example of being 'shaped' by the Quran.",
   "YouTube Title": "Saalim Mawla Abu Hudhaifa (ra)： The Imam of the People of Quran ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "18"
 },
 {
   "Name": "Shurahbil ibn Hasana",
   "Title": "The Scribe and Commander",
   "Reason behind the Title": "He was one of the few literate companions who served as both a scribe of the Quran and a major military commander.",
   "Lives Summary": "An early convert who migrated to Abyssinia and later became a scribe for the Quran in Medina. Under Abu Bakr and Umar, he was a main commander who opened Jordan and parts of Palestine. He passed away during the Plague of Amwas.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Combining intellectual skills with leadership. Modern Muslims should use their professional skills like literacy and administration to serve the faith and preserve its heritage.",
   "YouTube Title": "Shurahbil Ibn Hasana (ra)： The Scribe and Commander ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "19"
 },
 {
   "Name": "Talha Ibn Ubaydillah",
   "Title": "The Living Martyr",
   "Reason behind the Title": "Named 'Ash-Shahid al-Hayy' because he survived the Battle of Uhud despite suffering over 24-74 wounds as a human shield for the Prophet.",
   "Lives Summary": "One of the earliest converts and a wealthy merchant. He displayed legendary heroism at Uhud, suffering permanent paralysis in his hand to protect the Prophet. He was known for extreme generosity and was one of the ten promised paradise.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Selfless protection of mentors and leaders. In the modern age, we can follow this by protecting the reputations and well-being of the scholars and the vulnerable with our own standing.",
   "YouTube Title": "Talha Ibn Ubaydillah (ra)： The Living Martyr ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "20"
 },
 {
   "Name": "Ukasha ibn al-Mihsan",
   "Title": "The One Who Beat You To It",
   "Reason behind the Title": "Titled after the Prophet said 'Ukasha beat you to it' when he was the first to ask to be among the 70,000 who enter Paradise without reckoning.",
   "Lives Summary": "An early Meccan convert and veteran of Badr. During Badr, a stick he was given miraculously turned into a sword. He was known for his beauty, generosity, and constant smile. He died as a martyr during the Ridda wars.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "The importance of spiritual ambition. Modern believers should not hesitate when an opportunity for good arises, striving to be at the forefront of every righteous movement rather than waiting for others.",
   "YouTube Title": "Ukasha ibn al-Mihsan (ra)： He Beat You To It ｜ The Firsts Shorts ｜ Dr. Omar Suleiman",
   "Source": "21"
 },
 {
   "Name": "Umm Ayman (Baraka bint Tha'laba)",
   "Title": "My Mother after my Mother",
   "Reason behind the Title": "The Prophet called her this because she was his primary caregiver and nurse from birth until his death.",
   "Lives Summary": "An Abyssinian woman who served the Prophet's parents and was the first to hold him when he was born. She comforted him through his mother's death, migrated twice, and was promised Paradise multiple times by the Prophet.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Unwavering loyalty and lifelong dedication to a cause. We can apply this by showing lifelong care for the elders in our community and those who nurtured us in our youth, regardless of their status.",
   "YouTube Title": "Umm Ayman (ra)： The Woman Who Never Stopped Caring ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "22"
 },
 {
   "Name": "Umm Haram bint Milhan",
   "Title": "The Martyr of the Sea",
   "Reason behind the Title": "Prophesied to be among the first to cross the sea for the sake of Allah; she died during the first naval expedition.",
   "Lives Summary": "Maternal aunt of the Prophet who experienced heavy family losses at Uhud. At age 75, she joined the first Muslim naval expedition to Cyprus. Upon landing, she fell from her horse and died as a martyr, fulfilling the Prophet's vision.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Shows that age is no barrier to fulfilling one's dreams or serving a higher cause; encourages believers to hold onto their long-term spiritual goals with patience and conviction.",
   "YouTube Title": "Umm Haram (ra)： When Dreams Come True ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "23"
 },
 {
   "Name": "Uthman Ibn Affan",
   "Title": "Dhun-Nurayn (The Possessor of Two Lights)",
   "Reason behind the Title": "Titled because he married two of the Prophet's daughters, Ruqayyah and Umm Kulthum, a distinction unique to him.",
   "Lives Summary": "A wealthy merchant known for extreme modesty. He spent his fortune to support the community, purchasing the Well of Ruma and financing the Tabuk expedition. He served as the third Caliph, oversaw the official compilation of the Quran, and was martyred while reciting the scripture.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "He demonstrates how wealth should be used as a tool for public service. Professionals today should use their success to create sustainable endowments (Waqf) that benefit the community for generations.",
   "YouTube Title": "Uthman Ibn Affan (ra) - Part 1： The Possessor of Two Lights ｜ The Firsts ｜ Dr. Omar Suleiman; Uthman Ibn Affan (ra) - Part 2： Selfless Even When Slandered ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "24, 25"
 },
 {
   "Name": "Waraqa Ibn Nawfal",
   "Title": "The First to Confirm Prophethood",
   "Reason behind the Title": "He was the first person to recognize and testify that the revelation in the Cave of Hira was the same divine message sent to Moses.",
   "Lives Summary": "A cousin of Khadijah and a monotheist who studied ancient scriptures. He rejected idols long before Islam. When the Prophet received the first revelation, Waraqa confirmed his prophethood and warned of future persecution. He died shortly after this encounter.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Waraqa teaches the value of seeking truth through knowledge and being prepared to support justice before it becomes popular. We can apply this by being lifelong learners and standing up for truth immediately.",
   "YouTube Title": "Waraqa Ibn Nawfal (ra)： The First to Confirm Prophethood ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "26"
 },
 {
   "Name": "Zayd Ibn Al Haritha",
   "Title": "Hibbullah (The Beloved of the Prophet)",
   "Reason behind the Title": "The Prophet loved him so much that before the prohibition of adoption, he was known as Zayd ibn Muhammad.",
   "Lives Summary": "Kidnapped as a child and sold into slavery, he eventually entered the Prophet's household and chose to stay with him over his biological father. He was the first freed slave to accept Islam and is the only companion mentioned by name in the Quran. He was martyred at the Battle of Mu'tah.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Zayd’s life teaches that chosen family and loyalty based on character are stronger than blood ties. Modern society should treat employees with the same dignity and love that the Prophet showed Zayd.",
   "YouTube Title": "Zayd Ibn Al Haritha (ra)： Loved and Liberated ｜ The Firsts ｜ Dr. Omar Suleiman",
   "Source": "27"
 },
 {
   "Name": "Zaynab bint Muhammad",
   "Title": "The First Daughter",
   "Reason behind the Title": "She was the eldest daughter of the Prophet Muhammad and Khadijah.",
   "Lives Summary": "Married to Abu al-As ibn al-Rabi, she embraced Islam early but remained in Mecca for a time. After Badr, she was reunited with her father in Medina. She waited six years for her husband to convert, eventually being reunited shortly before her death.",
   "Categorization": "(The Forerunners)",
   "Lessons and Modern Application (Inferred)": "Maintain loyalty to family while remaining steadfast in faith. In the modern world, this teaches patience and hope in personal relationships and the belief that sincerity can bridge ideological divides.",
   "YouTube Title": "Zaynab (ra) Bint Muhammad ﷺ： The First Daughter ｜ The Firsts ｜ Dr. Omar Suleiman.mp3",
   "Source": "28"
 }
]